title: Sample Suspicious PowerShell
id: 1234-5678
description: Detects suspicious powershell execution
logsource:
  product: windows
  service: powershell
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains: 'Invoke-Expression'
  condition: selection
tags:
  - attack.execution
  - attack.t1059.001
